Revit 2026 API

# ViewportGetBoxCenter Method

---

Returns the center of the outline of the viewport on the sheet, excluding the viewport label.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public XYZ GetBoxCenter()
```
```vb
Public Function GetBoxCenter As XYZ
```
```cpp
public:
XYZ^ GetBoxCenter()
```
```fsharp
member GetBoxCenter : unit -> XYZ
```

#### Return Value

XYZ The center of the outline of the viewport on the sheet.

| Exception | Condition |
| --- | --- |
| InvalidOperationException | The viewport is not on a sheet. |

#### Reference

Viewport Class

Autodesk.Revit.DB Namespace